[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://m.media-amazon.com/images/I/71FTb9X6wsL.jpg",
    "review": "F. Scott Fitzgerald's 'The Great Gatsby' is a quintessential novel of the Jazz Age, a time of lavish parties and superficial excess contrasted with underlying moral decay. Set in 1920s New York, the story follows the mysterious Jay Gatsby, a self-made millionaire with a dubious past, and his obsession with the beautiful Daisy Buchanan. Through vivid prose and intricate storytelling, Fitzgerald explores themes of wealth, social class, and the elusive American Dream. The novel critiques the emptiness of materialism and the consequences of living in pursuit of shallow desires. 'The Great Gatsby' remains a timeless masterpiece that reveals the fragility of human aspirations amidst the glittering facade of success.",
    "totalPages": 180,
    "rating": 4.5,
    "category": "Classic",
    "tags": ["Classic", "American Dream"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://m.media-amazon.com/images/I/81aY1lxk+9L._SL1500_.jpg",
    "review": "Harper Lee's 'To Kill a Mockingbird' is a profound exploration of racial injustice, moral growth, and the loss of innocence in the American South during the 1930s. Through the eyes of Scout Finch, a young girl navigating the complexities of race and class, Lee exposes the deep-seated prejudices and injustices that divide society. The novel centers around Atticus Finch, Scout's father and a principled lawyer, who defends a black man falsely accused of raping a white woman. With powerful prose and poignant storytelling, Lee confronts themes of courage, compassion, and the consequences of prejudice. 'To Kill a Mockingbird' remains a timeless classic that challenges readers to confront uncomfortable truths about humanity and justice.",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Classic",
    "tags": ["Classic", "Civil Rights"],
    "publisher": "J.B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://m.media-amazon.com/images/I/71rpa1-kyvL._SL1500_.jpg",
    "review": "George Orwell's '1984' is a dystopian novel set in a totalitarian society ruled by the Party and its enigmatic leader, Big Brother. Published in 1949, Orwell's vision of a surveillance state where individuality is suppressed and truth is manipulated resonates with chilling relevance in the modern world. The story follows Winston Smith, a disillusioned Party member who secretly rebels against the oppressive regime. Through Winston's journey, Orwell explores themes of propaganda, thought control, and the erosion of freedom. '1984' serves as a stark warning about the dangers of authoritarianism and the importance of preserving democratic values. With its haunting portrayal of a bleak future, Orwell's masterpiece continues to provoke thought and discussion about power, truth, and resistance.",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Dystopian",
    "tags": ["Dystopian", "Political Fiction"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://m.media-amazon.com/images/I/71W--iKRHKL._SL1499_.jpg",
    "review": "Jane Austen's 'Pride and Prejudice' is a timeless romance that explores the nuances of social class, marriage, and love in 19th-century England. The novel follows the spirited Elizabeth Bennet, one of five sisters from a modest family, and the enigmatic Mr. Darcy, a wealthy and aloof gentleman. Set against the backdrop of rural England, Austen's witty and incisive prose delves into the complexities of human relationships and societal expectations. 'Pride and Prejudice' critiques the superficiality of society while celebrating the triumph of genuine love over societal norms. Austen's keen observations and sharp humor bring her characters to life, making this novel a beloved classic that continues to captivate readers with its timeless themes and unforgettable romance.",
    "totalPages": 279,
    "rating": 4.6,
    "category": "Classic",
    "tags": ["Romance", "Classic"],
    "publisher": "T. Egerton",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://m.media-amazon.com/images/I/71nXPGovoTL._SL1500_.jpg",
    "review": "J.D. Salinger's 'The Catcher in the Rye' is a compelling portrayal of teenage angst and rebellion in post-World War II America. Narrated by Holden Caulfield, a disenchanted and cynical teenager, the novel explores themes of alienation, identity, and the search for authenticity in a conformist society. Holden's journey through New York City is marked by encounters with various characters, each representing different facets of the adult world he distrusts. Through Salinger's distinctive voice and colloquial language, 'The Catcher in the Rye' captures the confusion and disillusionment of adolescence with raw honesty. The novel's enduring popularity lies in its ability to resonate with readers of all ages, offering a poignant reflection on the universal struggles of growing up and finding one's place in the world.",
    "totalPages": 214,
    "rating": 4.3,
    "category": "Classic",
    "tags": ["Classic", "Coming of Age"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://m.media-amazon.com/images/I/81-JdmZeA9L._SL1500_.jpg",
    "review": "J.R.R. Tolkien's 'The Hobbit' is a timeless fantasy adventure that introduces readers to the enchanting world of Middle-earth. The story follows Bilbo Baggins, a reluctant hobbit who is swept into an epic quest by the wizard Gandalf and a company of dwarves. Together, they journey across treacherous lands, encountering trolls, goblins, and the fearsome dragon Smaug. Tolkien's richly imagined universe comes to life through his masterful storytelling and vivid descriptions, weaving together themes of heroism, friendship, and the power of courage. 'The Hobbit' not only sets the stage for Tolkien's epic 'The Lord of the Rings' trilogy but stands on its own as a beloved classic that continues to captivate readers of all ages with its timeless charm and enduring sense of adventure.",
    "totalPages": 310,
    "rating": 4.7,
    "category": "Fantasy",
    "tags": ["Fantasy", "Adventure"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 7,
    "bookName": "Moby-Dick",
    "author": "Herman Melville",
    "image": "https://m.media-amazon.com/images/I/71EPmLBheAL._SL1360_.jpg",
    "review": "Herman Melville's 'Moby-Dick' is an epic tale of adventure, obsession, and the perils of man versus nature. Set against the backdrop of the 19th-century whaling industry, the novel follows Captain Ahab's relentless pursuit of the great white whale, Moby Dick, who had previously maimed Ahab and left him consumed by vengeance. Through Melville's intricate prose and philosophical digressions, 'Moby-Dick' explores themes of fate, morality, and the complexities of the human psyche. The novel's diverse cast of characters, including the narrator Ishmael, provides perspectives on life, death, and the relentless pursuit of an elusive goal. Melville's masterpiece challenges readers to contemplate the nature of obsession and the consequences of unchecked ambition, making 'Moby-Dick' a timeless classic that continues to inspire and provoke thought.",
    "totalPages": 585,
    "rating": 4.1,
    "category": "Adventure",
    "tags": ["Adventure", "Classic"],
    "publisher": "Harper & Brothers",
    "yearOfPublishing": 1851
  },
  {
    "bookId": 8,
    "bookName": "War and Peace",
    "author": "Leo Tolstoy",
    "image": "https://m.media-amazon.com/images/I/71wXZB-VtBL._SL1200_.jpg",
    "review": "Leo Tolstoy's 'War and Peace' is an epic novel that spans the Napoleonic Wars and explores the lives of several noble families in Russia. Published in 1869, Tolstoy's masterpiece intertwines historical events with fictional narratives, offering a panoramic view of Russian society during a time of political upheaval. The novel follows characters like Pierre Bezukhov, Andrei Bolkonsky, and Natasha Rostova as they navigate love, war, and personal transformation. Tolstoy's philosophical reflections on war, power, and the nature of existence are woven throughout the narrative, enriching the reader's understanding of human experience and destiny. 'War and Peace' is celebrated for its rich character development, vivid depiction of battle scenes, and profound insights into the human condition, making it a monumental work of literature that continues to captivate readers worldwide.",
    "totalPages": 1225,
    "rating": 4.4,
    "category": "Historical",
    "tags": ["Historical", "War"],
    "publisher": "The Russian Messenger",
    "yearOfPublishing": 1869
  },
  {
    "bookId": 9,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://m.media-amazon.com/images/I/71zHDXu1TaL._SL1500_.jpg",
    "review": "Paulo Coelho's 'The Alchemist' is a philosophical novel that follows the journey of Santiago, a shepherd boy who dreams of finding a hidden treasure in Egypt. Along his journey, Santiago encounters various spiritual and worldly challenges that lead him to discover the true essence of life and fulfillment. Coelho's narrative weaves together elements of adventure, mysticism, and self-discovery, urging readers to pursue their dreams and listen to their hearts. 'The Alchemist' explores universal themes such as destiny, faith, and the transformative power of pursuing one's personal legend. Through Santiago's quest, Coelho imparts timeless wisdom about the importance of embracing the unknown and following the path that leads to inner fulfillment and spiritual awakening.",
    "totalPages": 208,
    "rating": 4.3,
    "category": "Philosophical",
    "tags": ["Philosophical", "Adventure"],
    "publisher": "HarperOne",
    "yearOfPublishing": 1988
  }
]
